

tap "homebrew/cask-fonts"

# Install CLI Apps
brew "antidote"
brew "bat"
brew "coreutils" if OS.mac?
brew "d2"
brew "dialog"
brew "direnv"
brew "entr"
brew "findutils" if OS.mac?
brew "fzf"
brew "gh"
brew "gnupg" if OS.mac?
# brew "go-task"
brew "gping"
brew "gum"
brew "hr"
brew "jq"
brew "lsd"
brew "navi" # Interactive cheatsheet tool for the command-line
brew "neovim"
brew "parallel"
brew "python@3.10"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "teip"
brew "tmux"
brew "tree"
brew "watch" if OS.mac?
brew "zellij" # Terminal Multiplexer
brew "zoxide"
brew "zstd"

# Install GUI Apps
cask "db-browser-for-sqlite"
# cask "google-chrome"
cask "hammerspoon"
cask "iterm2"
cask "obsidian"
cask "maccy"
# cask "rectangle"
cask "signal"
cask "spotify"
cask "visual-studio-code"


# Install Fonts
# https://gist.github.com/davidteren/898f2dcccd42d9f8680ec69a3a5d350e
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "font-0xproto-nerd-font"
cask "font-agave-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-lilex-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-overpass-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"

# Want: https://rubjo.github.io/victor-mono/
