

tap "homebrew/cask-fonts"

# Install CLI Apps
brew "bat"
brew "direnv"
brew "d2"
brew "entr"
brew "fzf"
brew "gh"
brew "gnupg" if OS.mac?
brew "gum"
brew "hr"
brew "jq"
brew "neovim"
brew "python@3.10"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "go-task"
brew "teip"
brew "tmux"
brew "tree"
brew "zstd"
brew "findutils" if OS.mac?
brew "coreutils" if OS.mac?
brew "watch" if OS.mac?

# Install GUI Apps
cask "db-browser-for-sqlite"
# cask "google-chrome"
cask "hammerspoon"
cask "iterm2"
cask "joplin"
cask "maccy"
# cask "rectangle"
cask "signal"
cask "spotify"
cask "visual-studio-code"


# Install Fonts
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-source-code-pro"

